Tekla.Structures.Model.BaseWeld.WeldPreparationTypeEnum
Weld preparation types.

Tekla.Structures.Model.BaseWeld.WeldPreparationTypeEnum.PREPARATION_NONE
No preparation.

Tekla.Structures.Model.BaseWeld.WeldPreparationTypeEnum.PREPARATION_AUTO
Auto preparation.

Tekla.Structures.Model.BaseWeld.WeldPreparationTypeEnum.PREPARATION_MAIN
Main part preparation.

Tekla.Structures.Model.BaseWeld.WeldPreparationTypeEnum.PREPARATION_SECONDARY
Secondary part preparation.